In [1]:
import pandas as pd

In [2]:
data = {
    "ID": [1, 2, 3, 4, 5, 6, 7, 8, 2],
    "Name": ["Ali", "Sara", "Ali", "Ahmed", "Sara", "Zain", "Ali", "Ahmed", "Sara"],
    "Age": [25, 30, 25, 28, 30, 35, 25, 28, 30],
    "Salary": [50000, 60000, 50000, 55000, 60000, 70000, 50000, 55000, 60000],
    "City": ["Karachi", "Lahore", "Karachi", "Islamabad", "Lahore", "Karachi", "Karachi", "Islamabad", "Lahore"]
}

df = pd.DataFrame(data)
df

   ID   Name  Age  Salary       City
0   1    Ali   25   50000    Karachi
1   2   Sara   30   60000     Lahore
2   3    Ali   25   50000    Karachi
3   4  Ahmed   28   55000  Islamabad
4   5   Sara   30   60000     Lahore
5   6   Zain   35   70000    Karachi
6   7    Ali   25   50000    Karachi
7   8  Ahmed   28   55000  Islamabad
8   2   Sara   30   60000     Lahore

In [ ]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
dtype: bool

In [5]:
df.duplicated().sum()

np.int64(1)

In [6]:
df[df.duplicated()]

   ID  Name  Age  Salary    City
8   2  Sara   30   60000  Lahore

In [9]:
df['is_duplicate'] = df.duplicated()
df

   ID   Name  Age  Salary       City  is_duplicate
0   1    Ali   25   50000    Karachi         False
1   2   Sara   30   60000     Lahore         False
2   3    Ali   25   50000    Karachi         False
3   4  Ahmed   28   55000  Islamabad         False
4   5   Sara   30   60000     Lahore         False
5   6   Zain   35   70000    Karachi         False
6   7    Ali   25   50000    Karachi         False
7   8  Ahmed   28   55000  Islamabad         False
8   2   Sara   30   60000     Lahore          True

In [ ]:
df_clean = df.drop_duplicates(inplace=True)
df_clean

In [16]:
import os
print(os.getcwd())

c:\Users\Noman Traders\Documents\GitHub\ml-daily-journal\notebooks\Duplicate Data

In [20]:
from pathlib import Path

fname = "FlavorSense.csv"

# search current directory and parent directories for the file
matches = []
for root in [Path(".")] + list(Path.cwd().parents):
	matches.extend(list(root.rglob(fname)))

if matches:
	path = matches[0]
	print(f"Found file at: {path}")
	dataset = pd.read_csv(path)
	print(dataset.head(10))
else:
	print(f"File '{fname}' not found. Checked current and parent directories.")

Found file at: c:\Users\Noman Traders\Documents\GitHub\ml-daily-journal\datasets\FlavorSense.csv
    age sleep_cycle exercise_habits climate_zone historical_cuisine_exposure  \
0  56.0   Irregular           Heavy    Temperate                         NaN
1   NaN   Night Owl           Heavy    Temperate                       Asian
2  46.0   Night Owl           Heavy         Cold                       Mixed
3  32.0  Early Bird           Heavy         Cold               Mediterranean
4  60.0   Night Owl        Moderate          Dry               Mediterranean
5  25.0  Early Bird           Heavy         Cold               Mediterranean
6  38.0   Irregular           Light    Temperate                       Mixed
7  56.0         NaN           Light         Cold                       Mixed
8  36.0   Irregular           Light     Tropical               Mediterranean
9  40.0  Early Bird           Light    Temperate                       Asian

  preferred_taste
0           Salty
1           Sweet
2            Sour
3           Salty
4            Sour
5            Sour
6            Sour
7            Sour
8           Sweet
9           Sweet

In [22]:
dataset.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
9995    False
9996     True
9997    False
9998    False
9999     True
Length: 10000, dtype: bool

In [23]:
dataset.duplicated().sum()

np.int64(3676)

In [24]:
dataset.drop_duplicates(inplace=True)
dataset.reset_index(drop=True, inplace=True)

In [25]:
dataset.shape

(6324, 6)